In [1]:
import pandas as pd # Libreria para el an√°lisis y mannejo de los datos
import numpy as np  #Libreria para trabajar con calculos numericos y matrices

In [2]:
salaries = pd.read_csv("data.csv")

In [4]:
salaries.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181915 entries, 0 to 181914
Data columns (total 12 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   COUNTRY             181915 non-null  object
 1   CODE_TIME           181915 non-null  object
 2   TIME                181915 non-null  object
 3   YEAR                181915 non-null  int64
 4   MONTH               181915 non-null  int64
 5   MONTH_NAME          181915 non-null  object
 6   PRODUCT             181915 non-null  object
 7   VALUE               181915 non-null  float64
 8   DISPLAY_ORDER       181915 non-null  int64
 9   yearToDate          181915 non-null  float64
 10  previousYearToDate  164810 non-null  float64
 11  share               181915 non-null  float64
dtypes: float64(4), int64(3), object(5)
memory usage: 16.7+ MB

In [5]:
salaries.head()

,COUNTRY,CODE_TIME,TIME,YEAR,MONTH,MONTH_NAME,PRODUCT,VALUE,DISPLAY_ORDER,yearToDate,previousYearToDate,share
0,Australia,JAN2010,January 2010,2010,1,January,Hydro,990.728,1,16471.891,NaN,0.047771
1,Australia,JAN2010,January 2010,2010,1,January,Wind,409.469,2,4940.909,NaN,0.019744
2,Australia,JAN2010,January 2010,2010,1,January,Solar,49.216,3,908.238,NaN,0.002373
3,Australia,JAN2010,January 2010,2010,1,January,Geothermal,0.083,4,0.996,NaN,0.000004
4,Australia,JAN2010,January 2010,2010,1,January,Total combustible fuels,19289.730,7,214302.969,NaN,0.930108